Documents/ЗаявкаНаВозврат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявкаНаВозврат</Name>
			<BasedOn>
				<xr:Item>Document.РеализацияТоваровУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИзмененияЭтапаЭкспертизы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реализация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СертифицированнаяТорговаяТочка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяОтправкаТовараКлиенту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтампВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапЭкспертизы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭтапыЭкспретизы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОформленоНаПланшете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлПочтаКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСклада_СтороннийСклад</Name>
							<Comment>СправочникСсылка.СторонниеСклады</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СторонниеСклады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиИзРТУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтрокиКМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КодыМаркировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСтрокиКМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМаркировки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

WebServices/TransmitReturnFromPortal/Ext/Module.bsl
Функция TransmitReturnFromPortal(Header,Lines)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис TransmitReturnFromPortal", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. TransmitReturnFromPortal");
	ЗаписьЖурналаРегистрации("Web-сервис TransmitReturnFromPortal", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Параметры. TransmitReturnFromPortal: "
	+ Символы.ПС + МСКWEB.ПолучитьОписаниеПараметровВэбСервиса(Header) + Символы.ПС + МСКWEB.ПолучитьОписаниеПараметровВэбСервиса(Lines)); 

	Результат = ПолучитьВозвратыСПортала(Header,Lines); 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис TransmitReturnFromPortal", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. TransmitReturnFromPortal " 
	+ Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат Результат;

КонецФункции

Функция ПолучитьВозвратыСПортала(Шапка, Строки)
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Count");
	ТЗ.Колонки.Добавить("Comment");
	ТЗ.Колонки.Добавить("IsDost");
	ТЗ.Колонки.Добавить("ReasonRet");
	ТЗ.Колонки.Добавить("EID");
	ТЗ.Колонки.Добавить("SaleID");	                                                     
	ТЗ.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗ.Колонки.Добавить("ПроверятьКратность", Новый ОписаниеТипов("Булево")); 
	ТЗ.Колонки.Добавить("РТУ", Новый ОписаниеТипов("ДокументСсылка.РеализацияТоваровУслуг"));		
	
	Для Каждого Строка из Строки.lines Цикл
		
		СтрокаТЗ = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЗ,Строка);
		
		Реализация = Документы.РеализацияТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТЗ.SaleID));		
		
		Если ЗначениеЗаполнено(Реализация) Тогда  
			
			СтрокаТЗ.РТУ                = Реализация; 
			
			СтрокаТоварыТЧ              = Реализация.Товары[строкаТЗ.EID-1];
			СтрокаТЗ.Номенклатура       = СтрокаТоварыТЧ.Номенклатура; 
			СтрокаТЗ.ПроверятьКратность = МСК.НеобходимоПроверятьКратностьВЗаказе(СтрокаТоварыТЧ.ЗаказПокупателя);
			
		Иначе 
			СтрокаТЗ.РТУ                = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
		КонецЕсли; 	
		
	КонецЦикла;
	
	ТЗИтогиПоКоличеству = ТЗ.Скопировать(, "РТУ , ReasonRet, Номенклатура ,  ПроверятьКратность , Count");
	ТЗИтогиПоКоличеству.Свернуть("РТУ , ReasonRet , Номенклатура , ПроверятьКратность", "Count");
	ТЗ.Сортировать("SaleID,ReasonRet,EID"); 

	//Создаем объект для возврата
	ТипОтвет					= ФабрикаXDTO.Тип(Метаданные.WebСервисы.TransmitReturnFromPortal.ПространствоИмен, "ReturnOutForPortal");
	РезультатДляВозвратаПорталу = ФабрикаXDTO.Создать(ТипОтвет);
	
	ИД = "";
	ТипВозврата            = Неопределено;
	ТекНоменклатура		   = Неопределено;
	ДокВозврат             = Неопределено; 	
	ПромКомментарийОтмены  = "";    
	
	Для Каждого Строка Из ТЗ Цикл     

		Если (НЕ ИД = Строка.SaleID) ИЛИ (НЕ ТипВозврата = Строка.ReasonRet) ИЛИ (ИД = Строка.SaleID И (Строка.ReasonRet = 1 И НЕ ТекНоменклатура = Строка.Номенклатура)) Тогда

			ИД = Строка.SaleID;
			ТекНоменклатура = Строка.Номенклатура; 			
			ТипВозврата = Строка.ReasonRet;
			
			//Создаем строку ответа
			ТипСтрокаОтвета = ФабрикаXDTO.Тип(Метаданные.WebСервисы.TransmitReturnFromPortal.ПространствоИмен, "ReturnOutLine");
			СтрокаВозврата  = ФабрикаXDTO.Создать(ТипСтрокаОтвета);
			
			Если ДокВозврат <> Неопределено тогда
				
				ЗаполнитьСтатусыЗаявки(ДокВозврат, ДокВозврат.Статус, ПромКомментарийОтмены);
				ДокВозврат.Записать(?(ДокВозврат.Статус = "Отказ в возврате", РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
				
				СтрокаВозврата.STATUS = 0;
				РезультатДляВозвратаПорталу.OutForPortalLines.Добавить(СтрокаВозврата);	
				
			КонецЕсли;
			
			ПромНомерРеализации        = Строка.SaleID;
			СтрокаВозврата.SALE_Number = ПромНомерРеализации;
			
			ДокВозврат      = Документы.ЗаявкаНаВозврат.СоздатьДокумент();
			ДокВозврат.Дата = ТекущаяДата();
			
			Реализация = Документы.РеализацияТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(строка.SaleID));
			ДокВозврат.СертифицированнаяТорговаяТочка = Реализация.Грузополучатель.СертифицированнаяТорговаяТочка; 
			
			Если Не ЗначениеЗаполнено(Реализация) Тогда           
				
				СтрокаВозврата.MSG    = "В базе УТ не найдена реализация";
				СтрокаВозврата.STATUS = 1;
				РезультатДляВозвратаПорталу.OutForPortalLines.Добавить(СтрокаВозврата);
				ДокВозврат = Неопределено;
				ИД = "";
				Продолжить;    
				
			КонецЕсли;
			
			РеализацияПринадлежитДругомуКонтрагенту = Ложь;
			ПроверятьПоКодуМДМ = СтрДлина(Шапка.KONTRAGENT_) = 36;
			
			Если ПроверятьПоКодуМДМ Тогда
				РеализацияПринадлежитДругомуКонтрагенту = Реализация.Контрагент.КодМДМ <> Шапка.KONTRAGENT_;
			Иначе
				РеализацияПринадлежитДругомуКонтрагенту = СокрЛП(Реализация.Контрагент.IDАварда) <> СокрЛП(Шапка.KONTRAGENT_);	
			КонецЕсли;
			
			Если РеализацияПринадлежитДругомуКонтрагенту Тогда   
				
				СтрокаВозврата.MSG = "В базе УТ реализация принадлежит другому контрагенту";
				СтрокаВозврата.STATUS = 1;
				РезультатДляВозвратаПорталу.OutForPortalLines.Добавить(СтрокаВозврата);			
				ДокВозврат = Неопределено;
				ИД = "";
				Продолжить; 
				
			КонецЕсли;	
			
			ДокВозврат.Реализация = Реализация;
			ПромСтатусЗаявки = "На согласовании";
			КоличествоДнейДляВозврата = 0;
			
			Если НЕ Реализация.ДоговорКонтрагента.СрокВозврата = 0 Тогда
				КоличествоДнейДляВозврата = Реализация.ДоговорКонтрагента.СрокВозврата;
			Иначе				
				КоличествоДнейДляВозврата = Константы.КоличествоДнейВозврата.Получить(); 		
			КонецЕсли;  
			
			Если НЕ КоличествоДнейДляВозврата = 0 Тогда 
				
				Если НачалоДня(Реализация.Дата) < НачалоДня((ТекущаяДата() - 86400 * КоличествоДнейДляВозврата)) Тогда 
					
					ПромСтатусЗаявки      = "Отказ в возврате";
					ПромКомментарийОтмены = "Истек период для возврата.";    
					
				КонецЕсли;		
				
			КонецЕсли;	      
			
			ДокВозврат.Статус = ПромСтатусЗаявки;   
			
		КонецЕсли;

		СтрокаТовары = Реализация.Товары[строка.EID-1];
						
		Коэф = МСК.ПолучитьКратностьНоменклатуры(СтрокаТовары.Номенклатура);  
		
		Если Коэф = 0 Тогда 
			Коэф = 1; 
		КонецЕсли;            
		
		Если Строка.COUNT / Коэф <> Окр(Строка.COUNT / Коэф, 0) Тогда    
			
			Отбор = Новый Структура;
			Отбор.Вставить("РТУ"                , Реализация);
			Отбор.Вставить("Номенклатура"       , Строка.Номенклатура);
			Отбор.Вставить("ПроверятьКратность" , Строка.ПроверятьКратность); 
			Отбор.Вставить("ReasonRet"          , Строка.ReasonRet);
			
			Строки = ТЗИтогиПоКоличеству.НайтиСтроки(Отбор);  
			
			Если Строки.Количество() > 0 И (Строки[0].Count / Коэф <> Окр(Строки[0].Count / Коэф, 0)) И Строки[0].ПроверятьКратность Тогда  
				
				СтрокаВозврата.MSG    = "При возврате товара " + СтрокаТовары.Номенклатура + " количество должно быть кратно " + Строка(Коэф) ;
				СтрокаВозврата.STATUS = 1;
				РезультатДляВозвратаПорталу.OutForPortalLines.Добавить(СтрокаВозврата);			
				ДокВозврат = Неопределено;
				ИД = "";				
				Продолжить;	 
				
			КонецЕсли; 

		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		 "ВЫБРАТЬ
		 |	РеализацияТоваровУслугТовары.ЗаказПокупателя КАК Ссылка,
		 |	РеализацияТоваровУслугТовары.Номенклатура,
		 |	РеализацияТоваровУслугТовары.ЗаказПокупателя.IDСклада_СтороннийСклад КАК СтороннийСклад,
		 |	РеализацияТоваровУслугТовары.ЕдиницаИзмерения,
		 |	РеализацияТоваровУслугТовары.Цена
		 |ИЗ
		 |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		 |ГДЕ
		 |	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
		 |	И РеализацияТоваровУслугТовары.Номенклатура = &Номенклатура
		 |	И РеализацияТоваровУслугТовары.НомерСтроки = &НомерСтроки";
		
		Запрос.УстановитьПараметр("Ссылка"       , Реализация.Ссылка);
		Запрос.УстановитьПараметр("НомерСтроки"  , СтрокаТовары.НомерСтроки);		
		Запрос.УстановитьПараметр("Номенклатура" , СтрокаТовары.Номенклатура);
				
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		ЕстьРекламация = Ложь; 
		
		Пока РезультатЗапроса.Следующий() Цикл

			СтрокаВозврат = ДокВозврат.Товары.Добавить();			
			
			СтрокаВозврат.Номенклатура            = СтрокаТовары.Номенклатура;
			СтрокаВозврат.Количество              = Строка.Count;
			СтрокаВозврат.ЕдиницаИзмерения        = СтрокаТовары.ЕдиницаИзмерения;
			СтрокаВозврат.Комментарий             = Строка.Comment;
			СтрокаВозврат.Цена                    = РезультатЗапроса.Цена;
			СтрокаВозврат.IDСклада_СтороннийСклад = РезультатЗапроса.СтороннийСклад;			
			СтрокаВозврат.Сумма                   = СтрокаВозврат.Количество * СтрокаВозврат.Цена;
			СтрокаВозврат.Тип                     = ?(Строка.ReasonRet = 0, "Возврат", "Рекламация");
			СтрокаВозврат.НомерСтрокиИзРТУ        = СтрокаТовары.НомерСтроки;

			Если СтрокаВозврат.Тип      = "Рекламация" Тогда
				ЕстьРекламация = Истина;
			ИначеЕсли СтрокаВозврат.Тип = "Возврат" Тогда     
				
				Если ЗначениеЗаполнено(СтрокаВозврат.Комментарий)Тогда
					ДокВозврат.Комментарий = ДокВозврат.Комментарий + ?(ЗначениеЗаполнено(ДокВозврат.Комментарий), ", ", "") + СтрокаВозврат.Комментарий;
				КонецЕсли;  
				
			КонецЕсли; 
			
		КонецЦикла; 	
		
		ДокВозврат.Комментарий = ?(ЕстьРекламация, "", ДокВозврат.Комментарий);   
		
	КонецЦикла;
	
	Если ДокВозврат <> Неопределено тогда
		ЗаполнитьСтатусыЗаявки(ДокВозврат, ПромСтатусЗаявки, ПромКомментарийОтмены);
	КонецЕсли;	
	
	Если ДокВозврат <> Неопределено тогда      
		
		ДокВозврат.Записать(?(ДокВозврат.Статус = "Отказ в возврате", РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
		СтрокаВозврата.STATUS = 0;
		РезультатДляВозвратаПорталу.OutForPortalLines.Добавить(СтрокаВозврата);	  
		
	Иначе  
	КонецЕсли;             
	
	РезультатЗапроса = Неопределено;
	Запрос = Неопределено;
	
	Возврат РезультатДляВозвратаПорталу;
	
КонецФункции 

Процедура ЗаполнитьСтатусыЗаявки(ДокЗаявка, ПромСтатусЗаявки, ПромКомментарийОтмены)  
	
	ПромЕстьРекламация = Ложь;           
	
	Для Каждого СтрокаТаблВозврата Из ДокЗаявка.Товары Цикл  
		
		Если СтрокаТаблВозврата.Тип = "Рекламация" Тогда
			ПромЕстьРекламация = Истина;
		КонецЕсли;      
		
	КонецЦикла;	
	
	Если ПромЕстьРекламация Тогда   
		
		ДокЗаявка.Статус = "На согласовании";
		ПромКомментарийОтмены = ""; 
		
	Иначе            
		
		Если ПромСтатусЗаявки = "Отказ в возврате" Тогда     
			
			Для Каждого СтрокаТаблЧасти Из ДокЗаявка.Товары Цикл
				СтрокаТаблЧасти.Статус = ПромСтатусЗаявки;
			КонецЦикла;   
			
		КонецЕсли; 	
		
	КонецЕсли;
	
	Если НЕ ПромКомментарийОтмены = "" Тогда
		ДокЗаявка.Комментарий =  ПромКомментарийОтмены + " " + СокрЛП(ДокЗаявка.Комментарий);
	КонецЕсли;	
	
КонецПроцедуры
